In [ ]:
q1 = """SELECT * FROM movies.imdb_title_basics
JOIN imdb_title_ratings USING (tconst)"""

In [ ]:
# error code 2013 lost connection
q2 = """
SELECT * FROM movies.imdb_title_basics
JOIN imdb_title_ratings USING (tconst)
JOIN imdb_title_principals USING (tconst)
"""

to-do for 6.17 PM: 
- join name & principals by inspecting a few familiar titles
- filter basics table to select recently produced movies
- join movie name and budget --> profit!

Questions we can decide on: 
- do we want top box office or top profits? 
- how many films do we want to look at? 
- visualization scheme that makes sense for each data type

In [4]:
import pandas as pd
import numpy as np

In [10]:
import mysql.connector

con = mysql.connector.connect(user='hbs-student', password='super-secure-password?',
                              host='hbs-ds-060120.c1doesqrid0e.us-east-1.rds.amazonaws.com',
                              database='movies')

In [11]:
df2 = pd.read_sql_query("""
SELECT * FROM movies.tn_movie_budgets bud
JOIN imdb_title_basics ba ON bud.movie = ba.primary_title;
""", con)

In [12]:
df2.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,26,"Dec 31, 2012",Foodfight!,"$45,000,000",$0,"$73,706",tt0249516,Foodfight!,Foodfight!,2012,91.0,"Action,Animation,Comedy"
1,10,"Aug 18, 1995",Mortal Kombat,"$20,000,000","$70,433,227","$122,133,227",tt0293429,Mortal Kombat,Mortal Kombat,2021,NaN,"Action,Adventure,Fantasy"
2,17,"Mar 22, 2013",On the Road,"$25,000,000","$720,828","$9,313,302",tt0337692,On the Road,On the Road,2012,124.0,"Adventure,Drama,Romance"
3,37,"Dec 25, 2013",The Secret Life of Walter Mitty,"$91,000,000","$58,236,838","$187,861,183",tt0359950,The Secret Life of Walter Mitty,The Secret Life of Walter Mitty,2013,114.0,"Adventure,Comedy,Drama"
4,67,"Sep 19, 2014",A Walk Among the Tombstones,"$28,000,000","$26,017,685","$62,108,587",tt0365907,A Walk Among the Tombstones,A Walk Among the Tombstones,2014,114.0,"Action,Crime,Drama"

In [13]:
df2.shape

(3902, 12)

In [14]:
df.to_csv('data/title_budgets.csv')